#include <stdio.h>
int ch; /*Εξωτερική μεταβλητή ch για χαρακτήρες*/
int error1, error2, error3; /*Εξωτερικές μεταβλητές error*/

int ispaces(){ /*Συνάρτηση για αγνόηση των κενών χαρακτήρων*/
	while(ch==' ' || ch=='\t'){ /*Επανέλαβε όσο ο χαρακτήρας είναι το κενό*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
	}
	return ch;
}

int unumber(){ /*Συνάρτηση: αριθμός χωρίς πρόσημο*/
	int  i=0;
	/*Ένας αριθμός χωρίς πρόσημο είναι είτε ένα ψηφίο είτε μια ακολουθία από ένα ή περισσότερα ψηφία*/
	while (ch>='0' && ch<='9'){ /*Επανέλαβε όσο ο χαρακτήρας είναι ψηφίο*/
    	i= (ch-'0')+i*10;
        ch=getchar(); /*Επόμενος χαρακτήρας*/
	}
	ispaces(); /*Κάλεσε την συνάρητη ispaces για αγνόηση των κενών*/
	if (ch!='+' && ch!='-' && ch!='*' && ch!='\n' && ch!=')'){ /*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
		error1++; /*Σφάλμα: αύξησε τον μετρητή error*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
	}
	return i;
}

int snumber(){ /*Συνάρτηση: αριθμός με πρόσημο ή χωρίς*/
	int i=0;
	/*Ένας αριθμός είναι είτε χωρίς πρόσημο είτε με πρόσημο + ή -*/
	if (ch=='+'){ /*Αν έχει πρόσημο +*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος, δηλαδή αν δεν είναι ψηφίο*/
		if (ch=='\n' ){
			error3++; /*Αύξησε μετρητή error*/
		}
		if (!(ch>='0' && ch<='9')){
			error1++; /*Αύξησε μετρητή error*/
		}
		i=unumber(); /*Κάλεσε την συνάρητη unumber για αριθμό*/
	}
	else if (ch=='-'){ /*Αν έχει πρόσημο -*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος, δηλαδή αν δεν είναι ψηφίο*/
		if (ch=='\n'){
			error3++; /*Αύξησε μετρήτη error*/
		}
		if (!(ch>='0' && ch<='9')){
			error1++; /*Αύξησε μετρητή error*/
		}
		i=(-1)*unumber(); /*Κάλεσε την συνάρτηση unumber για αριθμό και πολλαπλασίασε με -1 γιατί είναι αρνητικός αριθμός*/
	}
	else if (ch>='0' && ch<='9') /*Αν δεν έχει πρόσημο*/
		i=unumber(); /*Κάλεσε την συνάρητηση unumber για αριθμό*/
	return i;
}

int factor(); /*Πρωτότυπο της συνάρτησης: παράγοντας*/

int term(){ /*Συνάρητη: όρος*/
	int i=0, j=0;
	/*Ένας όρος είναι είτε ένας παράγοντας είτε ένα γινόμενο παραγόντων*/
	i=factor(); /*Κάλεσε την συνάρτηση factor για τον παράγοντα*/
	while (ch=='*'){ /*Επανέλαβε όσο ο έχουμε πολλαπλασιασμό παραγόντων*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		ispaces(); /*Κάλεσε την συνάρτηση ispaces για αγνόηση κενών χαρακτήρων*/
		/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
		if (ch=='\n')
			error3++; /*Αύξησε μετρητή error*/
		if (ch!='(' && !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='\n'){
			error1++; /*Αύξησε μετρητή error*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
		}
		j=factor(); /*Κάλεσε την συνάρτηση factor για τον επόμενο παράγοντα*/
		i=i*j; /*Πολλαπλασιασμός των παραγόντων*/
	}
	return i;
}

int expression(){ /*Συνάρτηση: αριθμητική παράσταση*/
	int i=0, j=0; 
	/*Μία αριθμητική παράσταση είναι είτε ένας όρος είτε μια ακολουθία με προσθαφαιρέσεις δύο ή περισσότερων όρων*/
	ispaces(); /*Κάλεσε την συνάρτηση ispaces για αγνόηση κενών χαρακτήρων*/
	if ( !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='('){ /*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
		error1++; /*Αύξησε μετρητή error*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
	}
	i=term(); /*Κάλεσε την συνάρτηση: όρος*/
	while(ch=='+'){ /*Επανέλαβε όσο έχουμε πρόσθεση*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		ispaces(); /*Κάλεσε την συνάρητη ispaces για αγνόηση των κενών*/
		/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
		if (ch=='\n')
			error3++; /*Αύξησε μετρητή error*/
		if (ch!='(' && !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='\n'){
			error1++; /*Αύξησε μετρητή error*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
		}
		j=term(); /*Κάλεσε την συνάρτηση term για τον επόμενο όρο*/
		i= j+i; /*Πρόρθεση των δύο όρων*/
		while(ch=='-'){ /*Επανέλαβε όσο έχουμε αφαίρεση*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
			ispaces(); /*Κάλεσε την συνάρητη ispaces για αγνόηση των κενών*/
			/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
			if (ch=='\n')
				error3++; /*Αύξησε μετρητή error*/
			if (ch!='(' && !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='\n'){
				error1++; /*Αύξησε μετρητή error*/
				ch=getchar(); /*Επόμενος χαρακτήρας*/
			}
			j=term(); /*Κάλεσε την συνάρτηση term για τον επόμενο όρο*/
			i=i-j; /*Αφάιρεση των δύο όρων*/
		}
	}
	while(ch=='-'){ /*Επανέλαβε όσο έχουμε αφαίρεση*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		ispaces(); /*Κάλεσε την συνάρητη ispaces για αγνόηση των κενών*/
		/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
		if (ch=='\n')
			error3++; /*Αύξησε μετρητή error*/
		if (ch!='(' && !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='\n'){
			error1++; /*Αύξησε μετρητή error*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
		}
		j=term(); /*Κάλεσε την συνάρτηση term για τον επόμενο όρο*/
		i=i-j; /*Αφαίρεση των δύο όρων*/
		while(ch=='+'){ /*Επανέλαβε όσο έχουμε πρόσθεση*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
			ispaces(); /*Κάλεσε την συνάρητη ispaces για αγνόηση των κενών*/
			/*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
			if (ch=='\n')
				error3++; /*Αύξησε μετρητή error*/
			if (ch!='(' && !(ch>='0' && ch<='9') && ch!='+' && ch!='-' && ch!='\n'){
				error1++; /*Αύξησε μετρητή error*/
				ch=getchar(); /*Επόμενος χαρακτήρας*/
			}
			j=term(); /*Κάλεσε την συνάρτηση term για τον επόμενο όρο*/
			i= j+i; /*Πρόσθεση των δύο όρων*/
		}
	}

	return i;
}

int factor(){ /*Συνάρτηση: παράγοντας*/
	int i=0;
	/*Ένας παράγοντας είναι είτε ένας αριθμός είτε μια αριθμητική παράσταση μέσα σε παρενθέσεις*/
	i=snumber(); /*Κάλεσε την συνάρητη snumber για τον αριθμό*/
	if (ch=='('){ /*Αν έχουμε ανοιχτή παρένθεση*/
		ch=getchar(); /*Επόμενος χαρακτήρας*/
		i=expression(); /*Κάλεσε την συνάρτηση expression για την αριθμητική παράσταση*/
		if (ch==')'){ /*Αν κλείσει η παρένθεση*/
			ch=getchar(); /*Επόμενος χαρακτήρας*/
			ispaces(); /*Κάλεσε τη συνάρητη ispaces για αγνόηση των κενών χαρακτήρων*/
			return i;
		}
		if (ch=='\n'){ /*Αν ο χαρακτήρας δεν είναι ο προσδοκώμενος*/
			error2++; /*Σφάλμα: αύξησε τον μετρητή error*/
		}
	}
	return i;
}

int main(void){
	int  total=0, flag=0;
	while ((ch=getchar())!= EOF){ /*Επανέλαβε μέχρι ο χαρακτήρας να είναι EOF*/
		while (ch!='\n'){ /*Επανέλαβε μέχρι ο χαρακτήρας να είναι η αλλαγή γραμμής*/
			total=expression(); /*Το σύνολο είναι το αποτέλεσμα της αριθμητικής παράστασης*/
		}
		if (error1!=0){ /*Αν ο μετρήτης του error1 έχει αυξηθεί*/
			flag++; /*Αύξησε τον μετρητή των αριθμητικών παραστάσεων*/
			printf("Result %d: Unexpected character\n", flag);
		}
		else if (error2!=0){ /*Αν ο μετρήτης του error2 έχει αυξηθεί*/
			flag++; /*Αύξησε τον μετρητή των αριθμητικών παραστάσεων*/
			printf("Result %d: Missing closing parenthesis\n", flag);
		}
		else if (error3!=0){ /*Αν ο μετρήτης του error3 έχει αυξηθεί*/
			flag++; /*Αύξησε τον μετρητή των αριθμητικών παραστάσεων*/
			printf("Result %d: Unexpected end of input\n", flag);
		}
		else if (error1==0 && error2==0 && error3==0){ /*Αν κανένας μετρητής error δεν έχει αυξηθεί*/
			flag++; /*Αύξησε τον μετρητή των αριθμητικών παραστάσεων*/
			printf("Result %d: %d\n",flag,total);
		}
		/*Επαναφορά των μεταβλητών error*/
		error1=0;
		error2=0;
		error3=0;
	}
	return 0;
}
